In [1]:
import numpy as np

In [83]:
import multiprocessing as mp

fo = ["folder1","folder2","folder3","folder4"]
fi = ["csvfile1","csvfile2","csvfile3","csvfile4"]

def combine(a,b):
    print("Completed: ",a,'->',b)

pool = mp.Pool(processes=4)
results = [pool.apply_async(combine, args=(x)) for x in zip(fo,fi)]

##################################

results = pool.starmap_async(combine, zip(fo,fi))
# it needs `.get()` because it is `async`
print(results.get())

# non-async version

results = pool.starmap(combine, zip(fo,fi))
# it doesn't needs `.get()` because it is not `async`
print(results)

Completed:  folder2 -> csvfile2
Completed:  folder3 -> csvfile3
Completed:  folder1 -> csvfile1
Completed:  folder1 -> csvfile1
Completed:  folder4 -> csvfile4
Completed:  folder3 -> csvfile3
Completed:  folder2 -> csvfile2
Completed:  folder4 -> csvfile4
Completed:  folder2 -> csvfile2
Completed:  folder4 -> csvfile4
Completed:  folder1 -> csvfile1
[None, None, None, None]
[None, None, None, None]
Completed:  folder3 -> csvfile3

[None, None, None, None]
[None, None, None, None]

In [3]:
import pandas as pd

In [4]:
df = pd.read_clipboard('\s\s+')

In [14]:
df1 = df.iloc[:,:4].copy()

In [57]:
df

          Date Home_Team Away_Team Winner  Streak
0   2005-08-06         A         G      A       0
1   2005-08-06         B         H      H       0
2   2005-08-06         C         I      C       0
3   2005-08-06         D         J      J       0
4   2005-08-06         E         K      K       0
5   2005-08-06         F         L      F       0
6   2005-08-13         A         B      A       1
7   2005-08-13         C         D      D       1
8   2005-08-13         E         F      F       0
9   2005-08-13         G         H      H       0
10  2005-08-13         I         J      J       0
11  2005-08-13         K         L      K       1
12  2005-08-20         B         C      B       0
13  2005-08-20         A         D      A       2
14  2005-08-20         G         K      K       0
15  2005-08-20         I         E      E       0
16  2005-08-20         F         H      F       2
17  2005-08-20         J         L      J       2
18  2005-08-27         A         H      A       3
19  2005-08-27         B         F      B       1
20  2005-08-27         J         C      C       3
21  2005-08-27         D         E      D       0
22  2005-08-27         I         K      K       0
23  2005-08-27         L         G      G       0
24  2005-09-05         B         A      A       2
25  2005-09-05         D         C      D       1
26  2005-09-05         F         E      F       0
27  2005-09-05         H         G      H       0
28  2005-09-05         J         I      I       0
29  2005-09-05         K         L      K       4

In [67]:
o = 'D'

#Home and Away
home = np.array([1 if i==o else 0 for i in df['Home_Team']])
away = np.array([1 if i==o else 0 for i in df['Away_Team']])

#Wins and losses
wins = np.array([1 if i==o else 0 for i in df['Winner']])
loss = np.array([1 if (i==1 or j==1) and k==0 else 0 for i,j,k in zip(home, away, wins)])

#Streak
streak = np.array(df['Streak'])
truth = np.multiply(streak,home)

In [69]:
print('home:',home)
#print('away:',away)
print('wins:',wins)
print('loss:',loss)                
print('true:',truth)

home: [0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 0 0 0]
wins: [0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 0 0 0]
loss: [0 0 0 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0]
true: [0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0]

In [85]:
df = pd.DataFrame({'id':[1,1,1,2,2,2,2],'stage':[11,12,15,11,14,12,12],'value':[5,4,6,12,2,8,3]})

In [99]:
df.loc[df.sort_values(['id','stage'])['stage'].eq(12)]

   id  stage  value
1   1     12      4
5   2     12      8
6   2     12      3

In [100]:
df.sort_values(['id','stage'])

   id  stage  value
0   1     11      5
1   1     12      4
2   1     15      6
3   2     11     12
5   2     12      8
6   2     12      3
4   2     14      2

In [105]:
df

   id  stage  value
0   1     11      5
1   1     12      4
2   1     15      6
3   2     11     12
4   2     14      2
5   2     12      8
6   2     12      3

In [102]:
idx = df['stage'].eq(12).groupby(df['id']).transform('idxmax')
output = df[df.index <= idx].groupby('id')['value'].sum().reset_index()

In [127]:
list(df['stage'].eq(12).groupby(df['id']))#.apply('idxmax')

[(1, 0    False
  1     True
  2    False
  Name: stage, dtype: bool), (2, 3    False
  4    False
  5     True
  6     True
  Name: stage, dtype: bool)]

In [103]:
output

   id  value
0   1      9
1   2     22

In [ ]:
Location        DeptCode
Delhi           12B
Gurgoun         12D 
Hydrabad        13A 
Punjab          20A
Jhansi          31B

In [ ]:
Department        DeptCode
Electronics       [12A, 12B, 12C, 12D, 12E]
Electronics       [13A,13B,13Z]
Grocery           [20A]
Grocery           [31A,31B,31C]

In [145]:
df2 = pd.read_clipboard('\s\s+')

In [138]:
df1 = pd.read_clipboard('\s\s+')

In [149]:
import pandas as pd

In [150]:
df2

    Department                   DeptCode
0  Electronics  [12A, 12B, 12C, 12D, 12E]
1  Electronics              [13A,13B,13Z]
2      Grocery                      [20A]
3      Grocery              [31A,31B,31C]

In [153]:
df2.columns

Index(['Department', 'DeptCode'], dtype='object')

In [154]:
df2.explode('DeptCode')

    Department                   DeptCode
0  Electronics  [12A, 12B, 12C, 12D, 12E]
1  Electronics              [13A,13B,13Z]
2      Grocery                      [20A]
3      Grocery              [31A,31B,31C]